app/controllers/cases_controller.rb

  def show
    @case = Case.find(params[:id])
---
SELECT  "cases".* FROM "cases" WHERE "cases"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @case = Case.new(case_params)

    @case.save
---
INSERT INTO "cases" ("title", "description", "instruction", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ""], ["description", ""], ["instruction", ""], ["created_at", 2016-11-29 08:03:11 UTC], ["updated_at", 2016-11-29 08:03:11 UTC]]