app/controllers/tcases_controller.rb

SELECT "tcases".* FROM "tcases"
---
  def index
    @tcases = Tcase.all

SELECT  "tcases".* FROM "tcases" WHERE "tcases"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
---
  def show
    @tcase = Tcase.find(params[:id])

INSERT INTO "tcases" ("title", "description", "instruction", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "o"], ["description", "o"], ["instruction", "o"], ["created_at", 2016-11-29 08:27:02 UTC], ["updated_at", 2016-11-29 08:27:02 UTC]]
---
  def create
    @tcase = Tcase.new(tcase_params)

    if @tcase.save(tcase_params)

SELECT  "tcases".* FROM "tcases" WHERE "tcases"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
---
  def edit
    @tcase = Tcase.find(params[:id])

SELECT  "tcases".* FROM "tcases" WHERE "tcases"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tcases" SET "title" = $1, "description" = $2, "instruction" = $3, "updated_at" = $4 WHERE "tcases"."id" = $5  [["title", "u2"], ["description", "u2"], ["instruction", "u2"], ["updated_at", 2016-12-01 10:52:42 UTC], ["id", 42]]
---
  def update
    @tcase = Tcase.find(params[:id])

    if @tcase.update(tcase_params)

DELETE FROM "tcases" WHERE "tcases"."id" = $1  [["id", 36]]
SELECT  "tcases".* FROM "tcases" WHERE "tcases"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
---
  def destroy
    @tcase = Tcase.find(params[:id]).destroy