app/controllers/tsteps_controller.rb

SELECT  "tcases".* FROM "tcases" WHERE "tcases"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @tcase = Tcase.find(params[:tcase_id])